---
kind: method
id: M:Autodesk.Revit.DB.PlanViewRange.Dispose
source: html/e9adce93-1f75-e82a-67de-06eb3d9100ea.htm
---
# Autodesk.Revit.DB.PlanViewRange.Dispose Method

Releases all resources used by the PlanViewRange

## Syntax (C#)
```csharp
public void Dispose()
```